[Prélever des lignes d'un tableau Excel par formule Python](https://www.youtube.com/watch?v=F346x2Llf8I&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=33)

Date : 01/07/2025

In [1]:
import pandas as pd

In [3]:
tab = pd.read_excel('data/Take.xlsx', sheet_name='Feuil1')
tab.head().transpose()

                 0         1       2           3           4
Civilité  Monsieur    Madame  Madame      Madame    Monsieur
Nom         Hochon    Audine  Rouana   Hamalibou       Céhef
Prénom        Paul      Anne   Marie     Arlette      Hassan
CP           84000     83630   13129       83210        4120
Ville       avigon  AIGUINES   ARLES  BELGENTIER  CASTELLANE

Assignation de critères des références de lignes

In [4]:
crit1 = 6
crit2 = 8
crit3 = 15

Récupération des lignes n° 6, 8 et 15

In [6]:
tab.take([crit1, crit2, crit3]).transpose()

                            6          8                  15
Civilité              Monsieur     Madame           Monsieur
Nom                    Bonbeur  Tatouille               Noix
Prénom                  Martin      Laura           Stéphane
CP                       13830       6910               6700
Ville     ROQUEFORT LA BEDOULE     LE MAS  ST LAURENT DU VAR

Récupération de la ligne n° 6 à la ligne n° 15

In [8]:
tab.iloc[crit1:crit3+1].transpose()

,6,7,8,9,10,11,12,13,14,15
Civilité,Monsieur,Monsieur,Madame,Madame,Madame,Madame,Monsieur,Monsieur,Madame,Monsieur
Nom,Bonbeur,Houda,Tatouille,Sille,Hamalibou,Bernard,Maurice,Bonbeur,Hèresse,Noix
Prénom,Martin,Barrack,Laura,Lucie,Gisèle,Sarah,Philippe,Jean,Mégane,Stéphane
CP,13830,83130,6910,5150,13350,83670,13830,83440,4120,6700
Ville,ROQUEFORT LA BEDOULE,LA GARDE,LE MAS,MOYDANS,CHARLEVAL,PONTEVES,ROQUEFORT LA BEDOULE,SEILLANS,SOLEILHAS,ST LAURENT DU VAR